[
  {
    "pb_case_id": 81,
    "original_case_id": 183,
    "primary_subject": "bravehqnx.cc\n\n(Entity Impersonating Brave Software)",
    "complaint_narrative": "A fraudulent company is posing as Brave Software and offering investors alleged cryptocurrency investment opportunities, particularly involving Ethereum (ETH). The company runs a deceptive website that closely mimics Brave's branding and makes claims of high returns from crypto-mining or staking activities. Users are convinced into transferring their ETH or other cryptocurrencies to wallet addresses controlled by the company. Despite their efforts to communicate with the fraudulent platform's customer support and emails, victims report significant financial losses. The website is no longer in operation. \n\nThisis not to be confused with the crypto wallet service, Brave Wallet, at https://brave.com/wallet/.",
    "scam_type": "Fraudulent Trading Platform\n\nImposter Scam\n\nPig Butchering Scam",
    "website": "https://bravehqnx.cc/ \nbravehqnx.cc",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 82,
    "original_case_id": 184,
    "primary_subject": "Capital handels system \ncapitalhandelssystem.com",
    "complaint_narrative": "A California resident reports meeting someone on an online dating site who referred them to Capital Handels System, claiming they could make large profits by trading crypto assets within 72 hours. The victim sent money to the site, and their online friend said they would receive an email with withdrawal instructions after the trading concludes. The victim never got the email, despite sending several inquiries about how to withdraw. The victim reached out to their online friend, who said they would contact Capital Handels System for them. The online friend then said they heard from the company, and the victim needed to immediately send a payment in order to make a withdrawal.  The victim was not able to recover any of their funds. All told, they sent more than $10,000 to the website, which is no longer operational.",
    "scam_type": "Fraudulent Trading Platform\nPig Butchering Scam\nRomance Scam",
    "website": "https://capitalhandelssystem.com/\ncapitalhandelssystem.com",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 83,
    "original_case_id": 185,
    "primary_subject": "ICE crypto trading App\niceservicev@gmail.com",
    "complaint_narrative": "A California resident reports meeting someone on Telegram who introduced them to a crypto asset trading app called Ice. The victim downloaded the app and transferred money to it. The scammer then gave trading advice to the victim, who believed their balance appeared to increase to nearly $5,000. The victim was able to make a small withdraw of $79. But when they tried to withdraw a larger amount, the site demanded they pay $1,000 and send screenshots to ICE customer service as evidence that they complied with the instruction before they could make a withdrawal. The victim refused to pay and has been unable to recover their money.",
    "scam_type": "Fraudulent Trading Platform\nPig Butchering Scam",
    "website": "",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 84,
    "original_case_id": 186,
    "primary_subject": "ABS Trading\nabsgbl.com",
    "complaint_narrative": "A California resident reports meeting “Mona” after joining a crypto contract trading group via Whatsapp. Mona told the victim they could make money on the crypto asset trading platform operating at the website absgbl.com and instructed the victim on how to purchase crypto assets and transfer them to the platform. The victim began trading on the platform but became suspicious when Mona repeatedly asked when they were going to deposit more money. The victim tried to withdraw their money, but despite receiving a message from the website that the transaction was completed, they never received the money.  The website is no longer operational.",
    "scam_type": "Fraudulent Trading Platform\n\nPig Butchering Scam\n\nInvestment Group Scam",
    "website": "https://absgbl.com/#/home\nhttps://absgbl.com\nabsgbl.com",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 85,
    "original_case_id": 187,
    "primary_subject": "Top kex\ntopkex.com",
    "complaint_narrative": "A Californian reported using a crypto exchange platform, Topkex, to trade cryptocurrencies. The victim opened an account on the platform, deposited money, and began to trade. At first, the victim was able to successfully withdraw funds without any issues. After several weeks of trading, the victim believed their account had grown significantly. But then the victim received an email stating, “We have detected abnormal transaction data in your account, so we have frozen your account.\" The email demanded the victim send $30,000 to the wallet.  The victim transferred $3,000 but said they wouldn’t pay any more and told Topkex they were going to report these issues to federal authorities. Topkex, said it would close the victim’s account permanently and donate the money to charity. All told, the victim sent more than $50,000 to the site and has not been able to recover any of their money. The website is no longer operational.",
    "scam_type": "Fraudulent Trading Platform\nPig Butchering Scam",
    "website": "https://www.topkex.com/\ntopkex.com",
    "screenshot_url": "",
    "screenshot_local": ""
  }
]