[
  {
    "pb_case_id": 1,
    "original_case_id": 2,
    "primary_subject": "b2c2-amm.com",
    "complaint_narrative": "A California resident reports being contacted by an individual online who asked to move the conversation to a messaging platform.  After forming a relationship, the “friend” brought up the topic of investing in crypto assets, and introduced the victim to a crypto asset trading platform located at b2c2-amm.com, saying they could engage in “joint-investing” where the “friend” would match whatever amount the victim invested. After a while the platform told the victim there was a potential “data-breach” and demanded $77,000 to withdraw their funds. The victim paid, but the platform demanded an additional $100,000 “investment” to fully withdraw their funds. The victim did not pay and has been unable to withdraw their funds. The website is no longer operational.",
    "scam_type": "Fraudulent Trading Platform\n\nPig Butchering Scam",
    "website": "b2c2-amm.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/12/b2c2-Amm-Homepage-600.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_001_case_002.jpg"
  },
  {
    "pb_case_id": 2,
    "original_case_id": 9,
    "primary_subject": "web3app.rest",
    "complaint_narrative": "A California resident reports meeting an individual online named \"Aileen\" and beginning a relationship. Aileen told the resident how their aunt was a successful investor that owned properties in France and Croatia. At some point Aileen steered the conversation to investing in crypto assets, and suggested the victim start a “blockchain savings plan” on the crypto asset trading platform located at web3app.rest, claiming she had made money. After investing small amounts of money into the “short term savings plan”, the victim was able to withdraw some of their funds. Encouraged, the victim deposited more money onto the platform. At some point, the victim was asked to deposit $500,000 for “security fees.” The victim refused and now cannot withdraw their funds. The website is no longer operational. All told the victim lost more than $2.5 million on the platform.",
    "scam_type": "Fraudulent Trading Platform \n\nPig Butchering Scam",
    "website": "web3app.rest",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/12/web3app.rest-homepage.jpeg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_002_case_009.jpeg"
  },
  {
    "pb_case_id": 8,
    "original_case_id": 27,
    "primary_subject": "Up-Business\nhttp://up-business.top\nup-business.business",
    "complaint_narrative": "Two California residents reported about their experiences investing on the crypto asset trading platform Up-Business. The first victim was approached by “Raddy” on Facebook who suggested they continue their conversations on WhatsApp. Over time, Raddy began introducing the resident to crypto asset trading and eventually convinced the resident to invest with Raddy on the trading platform, located at the website up-business.top. Raddy convinced the victim they used an AI trading program that would generate stable returns. Following Raddy’s instructions the victim invested funds on the platform and believed they were earning substantial profits on the platform. But when the victim tried to withdraw funds from the platform, they were not able to. All told the victim lost more than $55,000 on the platform. The resident reported sending crypto to 0xB10ABECA64cf19d37c45045a5851BB528fB21E47. \n\nThe second victim was approached by “Reddy” on WhatsApp who convinced them to  create an account and transfer funds to a crypto asset trading platform located at up-business.business. Reddy convinced the victim they could earn profits with an AI-based crypto asset trading program, but they needed to make a minimum of five trades. The victim made the five trades and believed they had made a profit on the platform. But when the victim tried to withdraw funds, the platform’s customer support demanded they deposit additional funds and engage in five more trades first. Reddy encouraged the victim to do this, and soon the victim believed their account had grown to more than $100,000. But when the victim tried to withdraw funds again, the platform demanded they pay 10% of the withdrawal before it would release the funds. The victim has been unable to recover any funds and the platform is no longer operational.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "http://up-business.top/\nhttp://up-business.business/",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/10/Up.business.top-homepage-.jpeg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_008_case_027.jpeg"
  },
  {
    "pb_case_id": 9,
    "original_case_id": 34,
    "primary_subject": "Hrdebit\nhrdebit.com",
    "complaint_narrative": "A California resident reports meeting an individual named “Jack” who claimed he had developed a trading mechanism using AI that guaranteed profitable trades 100% of the time. Jack told the victim about a futures exchange trading platform, Hrdebit, operating at hrdebit.com where he would trade bitcoin for the both of them. Following Jack’s instructions, the victim set up an account and deposited funds, believing the account was worth more than $2 million after only a few weeks of investing. But when the victim tried to withdraw their profits, the platform’s customer service demanded a 20% service fee and that it would seize the funds if the victim didn’t pay. The victim has been unable to recover their funds from the platform and the website is no longer operational. All told, the resident lost at least $358,000 on the platform.",
    "scam_type": "Pig Butchering Scam \n\nAI Investment Scam",
    "website": "hrdebit.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/10/Hrdebit-640.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_009_case_034.jpg"
  },
  {
    "pb_case_id": 14,
    "original_case_id": 43,
    "primary_subject": "btc01.org",
    "complaint_narrative": "A California resident reports meeting an individual on an international dating app, Bumpy. After talking for a few months, the individual encouraged the resident to start investing on crypto asset trading platform, btc01.org. The website is no longer operational. The victim reports losing more than $46,000.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "btc01.org",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/09/btc01.org-Homepage.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_014_case_043.jpg"
  },
  {
    "pb_case_id": 15,
    "original_case_id": 47,
    "primary_subject": "pzmqgow.top",
    "complaint_narrative": "A California resident was contacted via social media and WhatsApp by “Samiya” who claimed to be associated with a well-known investment firm based in San Diego. Samiya promised high returns from investing in crypto and told the victim to download a crypto wallet app. Samiya then provided instructions on how to open an account on pzmqgow.top and send funds to the platform from the wallet app encouraged the victim to make multiple deposits. But when the victim tried to withdraw funds, the platform’s customer service demanded fees to release their funds. The resident has not been able to recover any funds and the website is no longer operational.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "pzmqgow.top",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/09/pzmqgow.top-Homepage.jpeg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_015_case_047.jpeg"
  },
  {
    "pb_case_id": 16,
    "original_case_id": 48,
    "primary_subject": "stdubrye.top",
    "complaint_narrative": "A California resident reports meeting an individual on an online dating app who introduced them to short-term crypto asset trading. The individual encouraged the resident to open an account on the crypto asset trading platform, stdubrye.top to begin trading. At the direction of the individual, the victim deposited money onto the platform to begin trading. But when the victim tried to withdraw funds, the platform demanded they pay $275,000. The victim did not pay, and the individual they met on the dating app stopped responding. The victim has been unable to recover any funds from the platform and the website is no longer operational. All told, the victim lost more than $240,000.",
    "scam_type": "Fraudulent Trading Platform\n\nPig Butchering Scam",
    "website": "https://stdubrye.top",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/09/Stdubyre.top-Homepage.jpeg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_016_case_048.jpeg"
  },
  {
    "pb_case_id": 23,
    "original_case_id": 66,
    "primary_subject": "Crypto-rd.top\n(Entity impersonating Crypto.com)",
    "complaint_narrative": "Two California consumers report on their experience with the crypto asset trading platform crypto-rd.top. \n\nThe first victim was introduced to cryptocurrency trading by an acquaintance who directed them to a DeFi Wallet platform located at Crypto-rd.top. The victim opened an account on the platform and began trading. But when the victim tried to access their funds, the platform demanded multiple fees including a platform fee, a “Know Your Customer” fee, and a “maintenance” fee, and another fee to release assets through the European Securities and Exchange Commission before they would release the funds. The victim has been unable to access any of their funds.\n\nThe consumer sent BTC to 3ES9qFnB35pTYV6frG59AUtgCtDMCKZ6nu and ETH to 0x0BFE55CbaB96AC7c9e6f2995D7BE9356fC5a9639.\n\nThe second victim lost access to their Crypto-rd.top platform wallet but then received a letter from “Rafael,” who claimed their wallet access would be fully restored if they paid the platform $75,000. The victim paid but did not regain access to their account and remain unable to withdraw any funds. The platform is no longer in operation. \n\nThis is not to confused with legitimate crypo exchange, Crypto.com.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "www.crypto-rd.top",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/07/crypto-rd.top-page-640.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_023_case_066.jpg"
  },
  {
    "pb_case_id": 24,
    "original_case_id": 67,
    "primary_subject": "RIOT Blockchain (Entity impersonating Riot Platforms)",
    "complaint_narrative": "A California resident reports they were contacted by Diana via WhatsApp, who offered them a job as a freelance crypto asset miner for the RIOT Blockchain platform, with no restrictions or set schedule and the ability to work remotely. The victim accepted the offer, completed all their training and was ready to begin working as a miner. At that point, the platform demanded the victim deposit their own funds first. The victim did so and worked daily, getting rewards for completing each task. However, the platform kept asking the victim to deposit increasing amounts of their own money to continue working. Further, the platform wouldn’t allow withdrawals unless the victim increased their “credibility rating” by depositing more funds. Eventually, the victim had to borrow money to continue to be able to work on the RIOT mining platform. Despite depositing nearly $81,000, the platform never allowed the victim to withdraw their funds. \n\nThis is not to be confused with the investment company, Riot Platforms at https://www.riotplatforms.com/",
    "scam_type": "Pig Butchering Scam\n\nCrypto Job Scam",
    "website": "",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/08/RIOT-Homepage-640.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_024_case_067.jpg"
  },
  {
    "pb_case_id": 25,
    "original_case_id": 68,
    "primary_subject": "cbotbit.com",
    "complaint_narrative": "A California resident met “Lin” through WhatsApp who steered the conversation to investing in crypto assets. Lin directed the victim to the crypto asset trading platform, CBOTBIT, located at https://cbotbit.com and showed them how to open an account and transfer funds. Following Lin’s instructions for trading, the victim believed their  account had grown substantially. But when the victim tried to withdraw funds from the platform, they were unable to do so. The website is no longer operational.  All told, the victim believed they lost more than $40,000.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "https://cbotbit.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/07/Cbotbit-Homepage640.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_025_case_068.jpg"
  },
  {
    "pb_case_id": 26,
    "original_case_id": 69,
    "primary_subject": "Cypo",
    "complaint_narrative": "A Californian reports on a crypto asset trading site known as “Cypo”, located at eth-cryp.com.  The victim was introduced to the site by a woman they met on a dating app.  The woman communicated with the victim on WhatsApp and also had several video calls with the victim.  In the calls, the woman showed the victim her crypto investment strategy, which she claimed would work whether crypto prices went up or down.  The woman asked the victim to invest with her on eth-cryp.com, so she could help them earn money using her strategy.  The victim decided to invest $34,000 and over time, believed the trading strategy made them over $150,000.  However, when the victim tried to withdraw profits, they were told they first had to pay $31,000 in taxes on their investment, and that this payment could not be deducted from their account balance.  The victim was eventually able to withdraw $2,000, but they could not access the rest of their funds.  The site is no longer operational.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "https://eth-cryp.com/#/ \nexp.gs-cdn.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/07/eth-cryp.com-Homepage-640.png",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_026_case_069.png"
  },
  {
    "pb_case_id": 32,
    "original_case_id": 91,
    "primary_subject": "dimensionvip.com\ndimensionalaccount.com\ndimesioal.com",
    "complaint_narrative": "Two consumers have reported their experiences with the crypto trading platform www.dimensionvip.com. The first consumer was approached by “Ryan” about an investment opportunity.  Ryan instructed the victim to open an account on the platform, after which the consumer began trading. But when the victim tried to withdraw their funds, the platform demanded they deposit additional funds to get their money back. The victim has been unable to recover their funds.\n\nThe second consumer reports being invited to a WhatsApp investment club group called \" “Dimensional Fund Advisors\". A representative  of the group approached the consumer and instructed them how to open an account on the Dimension platform. After transferring crypto assets and trading on the platform, the victim believed they had earned profits.  However, the platform demanded they pay fees in order to access their funds. All told, the consumer lost at least $5,000 on the platform, which is no longer operational. The victim report sending funds to the following wallet addresses:\n\n0x1D45F02c6D2729ba1AD8694597F51b0E4A0429A3\n0x7fF3e940eA4Db870e294C89D2ad579C27aC33A80\n0xd85b6EE53292bb0EEC259355C2B6471941D55002\n0xd9eACc4C3be80AB34c65Cd51bB623aa8620cD919\n0x490d095bBdfA1036E3ecAb18Cf3f5AD2Df73bf97",
    "scam_type": "Investment Group Scam\n\nFraudulent Trading Platform\n\nPig Butchering Scam",
    "website": "dimensionvip.com\ndimensionalaccount.com\ndimesioal.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/07/Dimensionvip640.png",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_032_case_091.png"
  },
  {
    "pb_case_id": 36,
    "original_case_id": 107,
    "primary_subject": "CryptoMMS Exchange Ltd\ncryptomms.co\ncrypto-mms.com",
    "complaint_narrative": "A California resident reports that Olivia on WhatsApp invited them to join a crypto trading group associated with a trading platform called CryptoMMS (cryptomms.co).  Additionally, Olivia told the victim that investors in a group traded crypto based on signals provided by a “Professor Parker”, and that the victim could earn profits of up to 70%.  “Professor Parker” claimed to have an SEC “license” and 40+ years of experience trading stocks, crypto, and forex.  The victim created and funded an account on the platform and began trading based on Professor Parker’s signals, believing they were earning profits.  But, when they tried to withdraw $2,000 from their account, they were unable to do so.  The victim tried to contact various accounts associated with the site, but they were no longer operational.  The victim has been unable to withdraw their money.\n\nA second victim from Canada also reports that someone on WhatsApp invited them to join CryptoMMS.  The victim was promised returns of up to 60% per day if they traded through the site based on signals from a trading guru named “James”.  The victim deposited about $12,000 in crypto on the site and began trading based on the trading signals, believing they were earning profits.  But, when they tried to withdraw their funds, CryptoMMS told the victim it was conducting a “security evaluation” of their account, and that their funds would be frozen for seven days.  But, after the seven-day period, the victim’s funds were still frozen.  The victim has still been unable to withdraw anything from their account. The site is no longer operational.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "cryptomms.co\ncrypto-mms.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/05/CryptoMMS-Exchange-Chat.jpeg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_036_case_107.jpeg"
  },
  {
    "pb_case_id": 37,
    "original_case_id": 111,
    "primary_subject": "Unktlife.com",
    "complaint_narrative": "A California resident reports meeting an individual through WeChat that represented himself as a famous model, with whom they subsequently formed a relationship. Eventually, the model brought up the topic of investing in crypto assets and taught the victim how to open an account on the website Unktlife.com and transfer crypto assets into it. At first, the victim believed they were making profits and was able to withdraw money from their account. This encouraged the victim to send even more money to Unktlife.com. But when the victim tried to withdraw money to buy a house, the website demanded they pay a “tax credit” to access their funds. The victim paid the fees but now Unktlife.com no longer responds to them and they haven’t been able to recover any more of their money. All told, the victim lost more than $550,000.The website is no longer operational.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "Unktlife.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/05/Unktlife.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_037_case_111.jpg"
  },
  {
    "pb_case_id": 42,
    "original_case_id": 120,
    "primary_subject": "GOO Market LLC\ngoomarketllc.info",
    "complaint_narrative": "A California resident reports about a family member who was contacted by a stranger on their cell phone and ended up engaging in conversation on WhatsApp. At some point, the stranger introduced the victim to the crypto asset trading platform, Goomarket LLC, at https://goomarketllc.info. The stranger convinced the victim to open an account on the platform and deposit funds to begin trading. Over time, the victim was led to believe they earned $5.3 million on the platform. But when the victim attempted to withdraw funds, the platform demanded they pay a tax before they could do so. The victim paid the tax, but when they attempted to withdraw funds, the platform said their request was halted due to suspicions of money laundering and demanded more money to clear up this issue. The victim has been unable to access their funds and the website is no longer operational. All told the victim lost more than $540,000.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "goomarketllc.info",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/04/GOO-Market-LLC.png",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_042_case_120.png"
  },
  {
    "pb_case_id": 46,
    "original_case_id": 135,
    "primary_subject": "Abnas Global",
    "complaint_narrative": "A California consumer met \"Tina” via WhatsApp and WeChat,  who introduced them to a crypto asset trading platform, Abnas Global. Tina provided links to Abnas Global at https://www.abnasglobal.com/#/home/modal and https://abnasglobal.cc/#/pc/trade. Tina also told the victim to download an app for the platform. Following Tina’s instructions, the victim downloaded the app, opened an account on the platform, transferred crypto assets, and began to trade bitcoins. Eventually, the victim's account showed a balance of more than $2,017,141.86. But when the victim tried to withdraw funds, Abnas Global demanded that they pay $240,000 in “taxes” or have their assets confiscated.  The victim reached out to Tina, who offered to pay some of the supposed tax, if the victim paid $100,000 to the platform. Then, Abnas Global demanded a fine of $160,000. Again, Tina convinced the victim to pay the fine by offering to pay the remaining balance after the victim paid $140,000 of the fine. Ultimately, the victim sent the platform more than $1,200,000, and has not retrieved any funds. None of the sites are operational now.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "https://abnasglobal.cc\nabnasglobal.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/04/Home-Page-Abnas-Global.png",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_046_case_135.png"
  },
  {
    "pb_case_id": 47,
    "original_case_id": 136,
    "primary_subject": "dydxgroup.com\nDYDX Wallet\n\n(Entity Impersonating dYdX Exchange)",
    "complaint_narrative": "A Californian reported about DYDX Wallet (dydxgroup.com).  The victim was introduced to DYDX Wallet by someone they met on a social media platform named “Nathan” who claimed to be a financial consultant offering free financial advice.  Nathan invited the victim to a WhatsApp group where he and his assistant Amy shared trading advice with his followers.  Nathan and Amy convinced followers to set up trading accounts on DYDX Wallet where they could trade based on Nathan’s advice.  \n\nFollowing Nathan and Amy’s instructions, the victim opened an account on DYDX Wallet and transferred money into it.  Nathan charged a fee to provide trading signals for the victim to follow, and the victim believed they had turned a quick profit.  But when the victim tried to withdraw money from their account, the site demanded they pay $3,000 more in commission to Nathan.  The victim paid but was not able to withdraw their balance.  In total, the victim lost about $22,000, including the $8,000 in commissions paid to “Nathan”. The site is no longer operational. This is not to be confused with the dYdX DeFi exchange at https://dydx.exchange/.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "https://www.dydxgroup.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/04/Option-Orders-Page-DYDX-850.png",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_047_case_136.png"
  },
  {
    "pb_case_id": 48,
    "original_case_id": 137,
    "primary_subject": "MIC Markets\nmicmarkfx.com\npc.micmarkfx.cc",
    "complaint_narrative": "Two Californians report about the crypto asset trading app, MIC Markets, at micmarkfx.com.  The first victim was introduced to MIC Markets by someone they met online.  The online acquaintance persuaded the victim to deposit $45,000 into a trading account on MIC Markets.  Over time, the victim believed they had doubled their money trading crypto assets.  At first, the victim was able to withdraw small amounts of money from their trading account.  But, when the victim tried to withdraw their total balance, their withdrawal was blocked.  The site demanded that the victim pay ”taxes” before they could withdraw.  They have since been unable to withdraw anything.\n\nThe second victim was introduced to MIC Markets by someone they met on a popular dating app.  After moving the conversation to WhatsApp, the romantic interest asked the victim to join him in investing money to create a strong financial future together.  The romantic interest asked the victim to download a Bitcoin wallet app and the MIC Markets trading app.  The imposter then appeared to add $1,000 to the victim’s account and executed a few trades, quickly making a 25% profit.  Based on this demonstration, the victim transferred \nthousands of dollars to their MIC Markets account, believing they would be able to turn a similar profit.  But then the romantic interest bullied the victim into funding their account with even more money, either from their 401(k) or from personal loans.  The victim subsequently took out a $20,000 loan and transferred it to their MIC Markets account.  \n\nOnce the victim’s profit reached $50,000, they tried to withdraw it.  But MIC Markets refused to process the withdrawal and demanded a 20% fee.  The romantic interest promised to pay part of the fee if the victim paid the rest using money from their 401(k).  At some point, the victim discovered that the romantic interest had used someone else’s photos and information to create a fake dating profile.  Soon after, MIC Markets blocked the victim from accessing their account at all.  The site is no longer operational.  In total, the victim lost about $20,000 to MIC Markets.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "http://m.micmarkfx.cc\nhttp://Micmarkfx.com\npg.micmarkfx.cc",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/04/Home-Tab-Mic-Markets462.png",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_048_case_137.png"
  },
  {
    "pb_case_id": 49,
    "original_case_id": 139,
    "primary_subject": "Xperiatrade\nXperiatrade.com",
    "complaint_narrative": "A California resident was approached on Instagram by Moneybynora, who claimed to be an investment advisor. Moneybynora convinced the resident to invest crypto assets on the trading platform, Xperiatrade.com, claiming they would be able to generate profits. Following Moneybynora’s instructions, the victim opened an account on the platform and began trading.  But, when they attempted to withdraw funds from the platform, the resident received a notification that their account was disabled and that that they would need to pay money for an encrypted code to make the withdrawal. The victim reports communicating with a “Mr. Alan” who purported to be the brokerage director for Xperiatrade.com and stated that he was unable to recover their funds. All told, the resident lost $5,080 on the platform and reported sending funds to the following wallet address: bc1qwzmg5dtk2tlyglevgh5rgdqtk72tly269dly6e.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "http://www.xperiatrade.com/",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/04/Home-Tab-Xperiatrade462.png",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_049_case_139.png"
  },
  {
    "pb_case_id": 57,
    "original_case_id": 158,
    "primary_subject": "Wealth BAX Finance wealthbax.com",
    "complaint_narrative": "A California resident reports receiving a text message from a stranger named “Sandy.” After some conversation, Sandy suggested they move their conversations over to WhatsApp where their relationship developed. At some point, Sandy brought up crypto assets and introduced the victim to a crypto asset trading platform called Wealth Bax. Sandy instructed the victim to open an account and transfer funds to the website \"h5.wealthbax.com/x/\". The victim was required to input their personal information, a picture of their driver’s license onto the website to create an account. The victim deposited crypto assets into their account and began trading. Sandy said that if the victim gave her money to help with her family, she in turn would add money to the victim’s account. At some point, the website showed that the investment was worth $281,992. But when the victim tried to withdraw money, the site demanded they pay IRS taxes of more than $40,000. When the victim reached out to Sandy, she said to pay, and that she had done so too in order to get her money. The victim was unable to withdraw any funds, and the site is no longer operational.",
    "scam_type": "Fraudulent Trading Platform\n\nPig Butchering Scam\n\nRomance Scam",
    "website": "https://wealthbax.com/\nhttps://h5.wealthbax.com\nh5.wealthbax.com/#/\nh5.wealthbax.com\nwealthbax.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/03/Wealthbax1000.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_057_case_158.jpg"
  },
  {
    "pb_case_id": 58,
    "original_case_id": 159,
    "primary_subject": "Tpkcoin \nweb.directcurrent.top",
    "complaint_narrative": "A California resident reports joining a group via the Telegram app where they would learn about crypto asset trading from Mason, supposedly a partner at a well-known financial company. Following instructions provided by the group, the victim opened an account with a supposed crypto asset trading platform, tpkcoin ( also known as directcurrent) and funds.  After this, the resident participated in a trading program called \"big data trading\" where they would receive trading signals from the leaders of the telegram group over the span of five days.  But when the trading event ended the trading platform told the victim they owed $29,000 in commissions. The victim tried to withdraw the money from the trading platform to pay the commissions but was told they needed to pay $48,000 in taxes first. When the victim said they did not have the money to pay the taxes, an assistant with the platform advised them to download a cold wallet to withdraw funds in small transactions in order to avoid paying the taxes. The victim said they wanted to seek further advice before following those instructions. After that, they were blocked from the trading platform and could no longer access their account. The website for the platform is no longer operational. All told, the victim has not been able to recover their $4,200.",
    "scam_type": "Fraudulent Trading Platform\n\nPig Butchering Scam\n\nSignal Selling Scam",
    "website": "https://web.directcurrent.top/mobile/home\nweb.directcurrent.top",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/04/TPKcoin-WhatsApp-Chat462.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_058_case_159.jpg"
  },
  {
    "pb_case_id": 59,
    "original_case_id": 160,
    "primary_subject": "SILD group crypto \nsildgroup.co\nsild.us",
    "complaint_narrative": "A California resident reports discovering a crypto asset investment group online led by a professor, Robert. Allegedly people were making revenue of 20 to 30% from their investments. Robert created a trading platform, SILD, where the entire group would trade together. The professor’s assistant, Angelina, showed the victim how to open an account on the SILD platform at sildgroup.co and make trades. The victim put in some money and began trading.\n\nThen, Robert then created a more exclusive trading platform where people could invest $50,000 to $3 million. The victim was told that they couldn’t participate in the new group because they didn’t have enough money. Angelina then reached out to the victim via WhatsApp, and told them their investment had tripled in two weeks, and encouraged them to try to join the new group.  When the victim said they had $50,000 in the bank, Angelina said all the $50,000 slots were taken, but they could still join if they put in $100,000. Angelina said that the victim should try to get as much money as possible and she would kick in the rest to get to $100,000. The victim went to their bank to liquidate a CD worth $50,000, but the bank wouldn’t allow the transfer, because the platform appeared to be suspicious. So, the victim sent the funds directly to Angela and later sent $25,000 to Angelina’s crypto wallet. The website is no longer operational. All told, the victim invested more than $85,000 and has not been able to recover any of their money.",
    "scam_type": "Fraudulent Trading Platform\n\nPig Butchering Scam\n\nInvestment Group Scam",
    "website": "https://sildgroup.co/index.html#/home\nhttps://sildgroup.co\nsild.us",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/03/IMG_spam310-redacted.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_059_case_160.jpg"
  },
  {
    "pb_case_id": 60,
    "original_case_id": 161,
    "primary_subject": "btm-vip.com\nbitaeqcke.net\n\n(Entity Impersonating BitMex)",
    "complaint_narrative": "A California resident reports being contacted by someone on Instagram, which led to a romantic relationship. At some point, the romantic interest brought up the subject of investing in crypto.  They helped the victim purchase crypto assets, showed them how to open an account on a crypto asset exchange at the website bitaeqcke.net, and then convinced them that their account balance was growing.  But, when the victim tried to withdraw the funds, the website demanded the a “tax profit” fee of more than $30,000 to be paid within 10 days. When the victim couldn’t pay, the person they met on Instagram cut off all communication. The victims have not been able to recover any of their funds from bitaeqcke.net and the website is no longer operational.\n\nThe fraudulent platform appears to be using the logo BitMex.  This is not to be confused with BitMex at https://www.bitmex.com/.",
    "scam_type": "Fraudulent Trading Platform\n\nImposter Scam\n\nPig Butchering Scam\n\nRomance Scam",
    "website": "https://www.btm-vip.com/#/\nwww.bitaeqcke.net\nbitaeqcke.net\nbtm-vip.com",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/03/btm1000.png",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_060_case_161.png"
  },
  {
    "pb_case_id": 61,
    "original_case_id": 162,
    "primary_subject": "webelon.org\n\n(Entity Impersonating Tesla and Elon Musk)",
    "complaint_narrative": "A California resident reports they viewed a Live Stream on YouTube where “Elon Musk” was offering to give away $100 million in crypto assets. The Livestream provided a QR code that when scanned led to the website webelon.org. Even though the Livestream promised a giveaway, people were required to send crypto assets to the site in order to participate. All told, the victim sent $5,000 to the wallet address bc1qnjy98m5g8d4qctp8s7v5j5jynsqhkdvvwm3840.  The website is no longer operational.\n\nThis scam appears to be impersonating Tesla by falsely using Tesla's logo on its promotional materials and platform. This is not to be confused with Tesla at https://www.tesla.com/.\nTesla is not in the business of promoting crypto giveaways.",
    "scam_type": "Fraudulent Trading Platform\n\nImposter Scam\n\nCrypto Giveaway/Airdrop Scam\n\nPig Butchering Scam",
    "website": "https://webelon.org\nwebelon.org",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/03/webelon-Promotion.jpg",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_061_case_162.jpg"
  },
  {
    "pb_case_id": 62,
    "original_case_id": 163,
    "primary_subject": "Capiturly.io",
    "complaint_narrative": "The victim was contacted by “Sharon,” who claimed to be a stock broker. Sharon convinced the victim to transfer Bitcoin to the website https://capiturly.io/ for trading purposes. The victim sent bitcoin to the following address: -bc1qdv4zpss0c0c868pwp8r0nvuds5vxwa0vtha2wm. After the transfer, the victim was unable to withdraw the funds.  The website is no longer in operation.",
    "scam_type": "Fraudulent Trading Platform\n\nPig Butchering Scam",
    "website": "https://capiturly.io/ \nCapiturly.io",
    "screenshot_url": "https://dfpi.ca.gov/wp-content/uploads/2025/03/Capiturly-io-Home-Page.png",
    "screenshot_local": "pig_butchering_cases\\screenshots\\pb_062_case_163.png"
  }
]