[
  {
    "pb_case_id": 51,
    "original_case_id": 142,
    "primary_subject": "Bitnice\nbit-nice.com",
    "complaint_narrative": "A California resident reports being approached by an individual through WhatsApp and presented with the opportunity to invest money to earn profits on the crypto asset trading platform Bitnice, located at bit-nice.com. Following the stranger’s instructions, the victim opened an account on the platform and deposited crypto assets onto the platform. After a while, the victim’s account showed they had made profits. But when they attempted to withdraw funds, the platform demanded the victim to pay money first. To date, the victim has not been able to recover any of their funds from the platform. The website is no longer operational. All told, the victim lost 1.01744435 Bitcoin and 3.725443 Ethereum tokens to the site.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "http://www.bit-nice.com/",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 52,
    "original_case_id": 150,
    "primary_subject": "Qexbit\nQexbit.org",
    "complaint_narrative": "A California resident reports being approached by “Wayne” on LinkedIn. After some conversation, Wayne suggested to move the conversations over to Facebook Messenger and over time the relationship developed into a romantic one. At some point, Wayne brought up the idea of investing in crypto and introduced the victim to the trading platform, Qexbit.org. Wayne showed the victim how to open an account on the platform and make a deposit. Then after making a successful trade, Wayne showed the victim how to withdraw some of the profits back to their crypto asset wallet. After this, Wayne convinced the victim to wire even more money to the platform for trading. \nAt some point, the victim believed their account balance on the platform had exceeded $3 million. But when they attempted to withdraw some of their funds, the platform informed the victim that their account was frozen and demanded they pay a service fee of $245,000 before they could withdraw their funds. The victim reached out to Wayne who promised to help. If the victim transferred $187,000, Wayne would mortgage his own watch for $60,000 and pay the rest of the service fee. The victim transferred the $187,000 to the platform. Wayne then said his account had been frozen as well, and asked the victim for $70,000 to help pay his service fee. The platform showed that the account had been unfrozen, but when the victim tried to make another withdrawal, the platform demanded $150,000 for a “user verification fee”. The victim reported they have not been able to recover any funds from the platform. All told, they lost more than $762,000.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "http://qexbit.org/",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 53,
    "original_case_id": 151,
    "primary_subject": "bridgewater-gh.com",
    "complaint_narrative": "A California resident reports meeting someone on a dating app and developing a relationship, eventually continuing their conversations over the phone. At some point, the friend introduced a crypto asset trading website called Bridgewater-gh.com, claiming to have relatives who were successful investors that could help the victim make money. The victim sent money to the website, but soon after became suspicious of its legitimacy. Following their friend’s instructions, the victim opened an account and transferred funds to begin trading.  But when the victim tried to withdraw their funds, Bridgewater-gh.com told the victim to upload a photo and ID for verification. Then their account was blocked. The victim was unable to recover any of their funds. The website is no longer operational.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "bridgewater-gh.com",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 54,
    "original_case_id": 152,
    "primary_subject": "Coinefx.com\ncoinexfmsl.com \nCoin EFX\nCoinefxiih.com",
    "complaint_narrative": "A California resident reports contacting “John” through the messaging app called KakaoTalk, mistakenly believing they were reaching out to a family member who shared the same name. They moved the conversations to text and video messages and developed a relationship. John claimed to work at a private equity firm in a division that focuses on crypto trading, and encouraged the victim to invest in cryptocurrency, promising he would help the victim build financial wealth. John introduced the victim to a global digital currency exchange platform called coinefxiih.com, claiming that this platform was safe, secure and trustworthy. Following John’s instructions, the victim believed they were making profits from their crypto investments and was even able to withdraw some money. But when the victim tried to withdraw more funds, Coinefx customer service said they had frozen the victim’s account because of “suspiciously high profits”, and demanded the victim pay 10% of the account value. The victim had to borrow money from family to pay this amount. When they tried to make another withdraw, the website demanded they pay another 8% of the account value to have a “blockchain technologist” involved. The victim paid the additional fee by taking out more loans and borrowing from their retirement account but was unable to access their account. Then John stopped talking to the victim. The website is no longer operational. All told, the victim lost more than $571,936.70.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "Coinefxiih.com",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 55,
    "original_case_id": 155,
    "primary_subject": "asx.zibbetmax.com\nasxcw.net\nASX.US",
    "complaint_narrative": "A California resident reported meeting “Li” on the WhasApp messaging app. Li claimed to be a manager at a cosmetic firm from Seattle, Washington. After several months of communication, Li persuaded the resident to trade gold futures using the cryptocurrency Tether on a purported crypto asset exchange called AXS.US, at asxcw.net. Following Li’s instruction, the resident wired money to a bank account in Vietnam in order to trade on the exchange. At some point, the victim believed their account had grown in value to more than $1,000,000. But when they tried to withdraw funds, a representative from the exchange demanded “taxes” before any withdrawals could be processed. The victim asked that the taxes be taken out of their profits, but the representative said no. To date, the resident has not recovered any of their money from asxcw.net. The website is no longer operational. All told, the victim lost approximately $75,000.",
    "scam_type": "Pig Butchering Scam\n\nFraudulent Trading Platform",
    "website": "https://asx.zibbetmax.com/#/home\nwww.asxcw.net",
    "screenshot_url": "",
    "screenshot_local": ""
  }
]