[
  {
    "pb_case_id": 96,
    "original_case_id": 200,
    "primary_subject": "graph web tsi plus\ngraphwebtsiplus.com/mining2dex/index.html#/\nweb3mwy.com",
    "complaint_narrative": "A California resident reports meeting a stranger online who directed them to the websites graphwebtsiplus.com and web3mwy.com, to make money from cryptocurrency mining.  The stranger gave instructions on how to access an account on the websites, add funds, and convert crypto assets into the kind used on the site.  The victim transferred assets from their cryptocurrency wallet to https://www.graphwebtsiplus.com/mining2dex/index.html#/.  The victim believed they had made profits but has been unable to recover any of their funds, and the websites are no longer operational.",
    "scam_type": "Fraudulent Trading Platform\nLiquidity Mining Scam\nPig Butchering Scam",
    "website": "https://www.graphwebtsiplus.com/mining2dex/index.html#/\nweb3mwy.com",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 97,
    "original_case_id": 201,
    "primary_subject": "dydxcc.com",
    "complaint_narrative": "A California resident reports meeting “Susana” online, and they communicated via WhatsApp. At some point Susana brought up the topic of investing in crypto assets and introduced the victim to a site called dydxcc.com where Susana claimed to be a senior representative. At first, the victim invested approximately $9,000, and they were able to withdraw a small portion of their funds.  Over time, the site showed that their investment had increased to $221,000. But when the victim tried to withdraw a larger amount, the online customer service for the site denied the request, claiming that the request was being reviewed for security reasons. Then Dydxcc.com claimed that because the victim had chosen a “High Yield Account,” in order to make large withdrawals they were required to be a “VIP” customer, requiring their account to contain at least $1,000,000, or else they could pay a 20% fee of their current value of their account to withdraw funds. The victim refused to pay the $44,415 fee, and the site then froze the victim’s account and denied further withdrawals. The victim then reached out to Susana, who claimed she had faced a similar experience and that the only option was to pay the fee.  The victim has been unable to recover their funds, and the website was no longer accessible. The victim also reports they referred two friends to dxyxcc.com, who encountered similar experiences.",
    "scam_type": "Fraudulent Trading Platform\n\nPig Butchering Scam",
    "website": "http://dydxcc.com/\ndydxcc.com",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 98,
    "original_case_id": 202,
    "primary_subject": "www.lklee.cc",
    "complaint_narrative": "A California resident reports meeting “Jack” online and they communicated through text message as well as other communication channels, including Erchat, WhatsApp, and Line. At some point, Jack told the victim they could make large profits trading gold on the website www.Iklee.cc. Jack provided instructions on how to send money to a crypto exchange and then transfer the crypto assets to the site where they could trade gold. After reporting that their account was profitable, Jack told the victim that if they upgraded to a “platinum” membership, the site would give a $100,000 bonus. The victim did not want to do this, but they received an email notification from the site that their membership had been upgraded and they needed to maintain an account balance of $500,000 or they would be sued, their credit would be affected, and they would have to pay penalties. The victim has not been able to withdraw any funds from their account, and the site is no longer active. All told, they lost $49,000.",
    "scam_type": "Fraudulent Trading Platform\n\nPig Butchering Scam",
    "website": "https://www.lklee.cc/\nhttps://www.lklee.cc\nwww.lklee.cc\nlklee.cc",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 99,
    "original_case_id": 203,
    "primary_subject": "public IP\n www.publicip.vip",
    "complaint_narrative": "A California resident reports meeting someone online who introduced them to a crypto trading website called Publicip.vip. The stranger coached the victim via Telegram and guided them through each step of how to open an account on the site and transfer assets. The victim transferred $15,000 to this website but is now unable to withdraw any funds.  The site is no longer operational.",
    "scam_type": "Fraudulent Trading Platform\n\nPig Butchering Scam",
    "website": "https://www.publicip.vip/\nhttps://www.publicip.vip\nwww.publicip.vip\nPublicip.vip",
    "screenshot_url": "",
    "screenshot_local": ""
  },
  {
    "pb_case_id": 100,
    "original_case_id": 204,
    "primary_subject": "Bit vox coin\nbitvoxcoin.com",
    "complaint_narrative": "A California victim reports they saw a Facebook ad about investing in crypto and, after clicking the ad, was invited via WhatsApp to join a trading group.  The victim was introduced to Anthony who convinced them to open an account and trade crypto assets on the crypto exchange platform bitvoxcoin.com.\n\nAfter a month of earning profits on the crypto platform, the platform demanded that the victim pay  10% commissions.  The victim paid, but when they tried to make a withdrawal, they were told they needed to pay an additional 10% “personal income tax fee”.   The victim has not been able to recover any of their money and the websites are no longer operational.\n\nThe victim reported sending funds to the following wallet addresses:\n0xe9B5aAD40cC30F82343CDC8F7c947Bb30DADAe1C\n0xCA703c3D290eDA004935c63719eEEe2c04792272\n0x65862927Fb58B7bb7c1875211E679775955c1993",
    "scam_type": "Pig Butchering Scam\n\nInvestment Group Scam",
    "website": "http://www.bitvoxcoin.com/\nhttp://bitvoxcoin.com\nbitvoxcoin.com",
    "screenshot_url": "",
    "screenshot_local": ""
  }
]